# Дано число R и список A размера N. Найти элемент списка, который наиболее близок
# к числу R (то есть такой элемент AK, для которого величина |AK - R| является
# минимальной).

import random


def closest(R, A):
    closest_v = A[0]  # первый элемент наиболее близкий
    min_dif = abs(closest_v - R)  # разница между первым элементом и R

    for element in A:
        dif = abs(element - R)  # находим разницу между текущим элементом и R
        if dif < min_dif:  # если разница меньше наименьшей до этого
            min_dif = dif  # обновляем наименьшую разницу
            closest_v = element  # текущий элемент становится "наиболее близким"

    print(f"Наиболее близкий элемент к {R} из списка {A}: {closest_v}")  # печатаем результат


# получаем число R
R = float(input("Введите число R: "))

# генерируем список случайных чисел
N = 10  # длина списка
A = [random.randint(1, 100) for _ in range(N)]  # генерируем список случайных чисел

closest(R, A)
