# Дана непустая строка S. Вывести строку, содержащую символы строки S, между
# которыми вставлено по одному пробелу.


line = input('Введите что-то: ' + '\n')
spaced = " ".join(line)

print(f'Ваш результат: {spaced}')


