info_users = [
    (1, 'Белов', 'Москва', 6004.0, 3000.0, 'Транспорт', 3500.0),
    (2, 'Иванов', 'Архангельск', 5400.0, 2800.0, 'Транспорт', 3200.0),
    (3, 'Артемов', 'Ростов-на-Дону', 7600.0, 4300.0, 'Питание', 3700.0),
    (4, 'Бушкин', 'Владивосток', 8920.0, 5600.0, 'Жилье', 5600.0),
    (5, 'Бостоевский', 'Мурманск', 21440.0, 16530.0, 'Питание', 4400.0),
    (6, 'Гризман', 'Орел', 21900.0, 17200.0, 'Транспорт', 6800.0),
    (7, 'Месси', 'Ижевск', 34020.0, 21453.0, 'Питание', 12000.0),
    (8, 'Роналдо', 'Пермь', 84880.0, 64220.0, 'Транспорт', 34020.0),
    (9, 'Кокорин', 'Санкт-Петербург', 50020.0, 27490.0, 'Транспорт', 30420.0),
    (10, 'Федоров', 'Ростов', 50241.0, 2750.0, 'Жилье', 3540.0)
]
